webservices/webservices-web/src/test/resources/test1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:soap="http://soap.webservices.oncourse.ish/">
	<soapenv:Header>
		<wss:Security
			xmlns:wss="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wss:UsernameToken>
				<wss:Username>alice</wss:Username>
				<wss:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">FPqPsaAp7hWASdknPsbfZxIoDVI=</wss:Password>
				<wss:Nonce
					EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">OJBNzEGDmTiD/lbeA+UDeg==</wss:Nonce>
				<wsu:Created
					xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">2009-12-10T21:12:59.100Z</wsu:Created>
			</wss:UsernameToken>
		</wss:Security>
	</soapenv:Header>
	<soapenv:Body>
		<soap:getCountries>
			<!--Optional: -->
			<arg0>1</arg0>
		</soap:getCountries>
	</soapenv:Body>
</soapenv:Envelope>